/******************************************************************************
 * This file is part of the Simple Text Processing Library(STPL).
 * (c) Copyright 2007-2010 TYONLINE TECHNOLOGY PTY. LTD.
 *
 * This file may be distributed and/or modified under the terms of the
 * GNU LESSER GENERAL PUBLIC LICENSE, Version 3 as published by the Free Software
 * Foundation and appearing in the file LICENSE.LGPL included in the
 * packaging of this file.
 *
 * This file is provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING THE
 * WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
 *
 *
 *******************************************************************************
 *
 * @author				Ling-Xiang(Eric) Tang
 *
 *******************************************************************************/

#ifndef NLP_QA_TEMPLATE_CHINESE_H_
#define NLP_QA_TEMPLATE_CHINESE_H_

namespace stpl
{
	namespace nlp
	{
		const char *question_phrase_chinese[] = {
				"\344\271\213\351\227\264\346\234\211\344\273\200\344\271\210\345\205\263\347\263\273", // 之间有什么关系
				"\347\232\204\345\256\232\344\271\211\346\230\257\344\273\200\344\271\210", // 的定义是什么
				"\347\232\204\345\205\263\347\263\273\346\230\257\344\273\200\344\271\210", // 的关系是什么
				"\345\217\221\347\224\237\344\272\206\344\273\200\344\271\210\344\272\213", // 发生了什么事
				"\346\230\257\344\273\200\344\271\210\345\205\263\347\263\273", // 是什么关系
				"\346\230\257\344\273\200\344\271\210\346\227\266\345\200\231", // 是什么时候
				"\347\232\204\345\205\263\347\263\273\345\246\202\344\275\225", // 的关系如何
				"\344\271\213\351\227\264\346\234\211\344\273\200\344\271\210", // 之间有什么
				"\350\257\267\347\256\200\347\237\255\347\256\200\350\277\260", // 请简短简述
				"\350\257\267\347\256\200\345\215\225\347\256\200\350\277\260", // 请简单简述
				"\344\273\200\344\271\210\346\227\266\345\200\231", // 什么时候
				"\344\273\200\344\271\210\345\205\263\347\263\273", // 什么关系
				"\347\232\204\345\205\263\347\263\273\346\230\257", // 的关系是
				"\346\234\211\344\275\225\345\205\263\347\263\273", // 有何关系
				"\345\205\263\347\263\273\345\246\202\344\275\225", // 关系如何
				"\346\234\211\344\275\225\347\233\270\345\205\263", // 有何相关
				"\346\234\211\344\275\225\346\270\212\346\272\220", // 有何渊源
				"\344\270\272\344\273\200\344\271\210\344\274\232", // 为什么会
				"\344\270\272\344\273\200\344\271\210\350\246\201", // 为什么要
				"\344\270\272\344\273\200\344\271\210\350\203\275", // 为什么能
				"\346\230\257\345\223\252\344\270\200\345\271\264", // 是哪一年
				"\344\273\200\344\271\210\346\227\266\345\200\231", // 什么时候
				"\344\275\215\344\272\216\345\223\252\351\207\214", // 位于哪里
				"\344\273\200\344\271\210\346\240\267\347\232\204", // 什么样的
				"\344\275\240\350\203\275\344\270\215\350\203\275", // 你能不能
				"\347\233\270\344\272\222\344\271\213\351\227\264", // 相互之间
				"\344\273\243\350\241\250\344\273\200\344\271\210", // 代表什么
				"\347\256\200\347\237\255\347\256\200\350\277\260", // 简短简述
				"\347\256\200\345\215\225\347\256\200\350\277\260", // 简单简述
				"\347\256\200\347\237\255\346\217\217\350\277\260", // 简短描述
				"\347\256\200\345\215\225\346\217\217\350\277\260", // 简单描述
				"\344\270\272\344\273\200\344\271\210", // 为什么
				"\346\230\257\344\273\200\344\271\210", // 是什么
				"\344\273\200\344\271\210\346\230\257", // 什么是
				"\347\232\204\345\205\263\347\263\273", // 的关系
				"\345\234\250\345\223\252\351\207\214", // 在哪里
				"\346\200\216\344\271\210\346\240\267", // 怎么样
				"\346\234\211\345\223\252\344\272\233", // 有哪些
				"\344\273\200\344\271\210\344\272\213", // 什么事
				"\346\230\257\345\223\252\344\270\252", // 是哪个
				"\346\230\257\345\223\252\345\256\266", // 是哪家
				"\346\234\211\344\273\200\344\271\210", // 有什么
				"\350\257\267\345\210\227\345\207\272", // 请列出
				"\350\257\267\345\210\227\344\270\276", // 请列举
				"\350\257\267\346\217\217\350\277\260", // 请描述
				"\345\223\252\344\270\200\345\271\264", // 哪一年
				"\350\257\267\347\256\200\350\277\260", // 请简述
				"\350\203\275\344\270\215\350\203\275", // 能不能
				"\347\232\204\345\256\232\344\271\211", // 的定义
				"\344\275\225\346\227\266", // 何时
				"\350\260\201\346\230\257", // 谁是
				"\346\230\257\350\260\201", // 是谁
				"\345\246\202\344\275\225", // 如何
				"\345\223\252\344\270\252", // 哪个
				"\345\210\227\344\270\276", // 列举
				"\350\257\267\351\227\256", // 请问
				"\344\275\225\350\260\223", // 何谓
				"\344\275\225\344\273\245", // 何以
				"\344\270\272\344\275\225", // 为何
				"\346\217\217\350\277\260", // 描述
				"\346\234\211\344\275\225", // 有何
				"\347\256\200\350\277\260", // 简述
				"\345\223\252\344\272\233", // 哪些
				"\344\273\200\344\271\210", // 什么
				"\344\271\213\351\227\264", // 之间
				"\346\234\211\345\205\263", // 有关
				"\345\256\232\344\271\211", // 定义
				"\350\247\243\351\207\212"  // 解释
		};

		extern const int question_phrase_chinese_length;

		const char *question_phrase_english[] = {
				"who is",
				"who was",
				"who were",
				"who will",

				"what is the definition of",
				"what is the interrelationship of",
				"what is the inter-relationship of",
				"what is the relationship between",
				"what is the interrelationship between",
				"what is the inter-relationship between",
				"what links are there",
				"what link is there",

				"what is",
				"what was",
				"what are",
				"what were",
				"what does",
				"what happened",

				"when is",
				"when was",
				"when were",
				"when will",
				"when did",
				"when do",

				"where will",
				"where is",
				"where are",
				"where were",

				"how is",
				"how was",
				"how were",
				"how did",

				"why does",
				"why is",
				"why was",
				"why do",
				"why did",
				"why were",
				"why can",
				"why had"

				"which is",
				"which was",
				"which year",

				"please list",

				"describe the relationship between",
				"describe the interrelationship between",
				"describe the inter-relationship between",
				"describe the interrelationship of",
				"describe the inter-relationship of",
				"describe the relationship of",

				"could you please give short descriptions to",
				"could you please give short descriptions of",
				"could you give short description to",
				"could you give short descriptions to",

				"who",
				"where",
				"what",
				"which",
				"how",

				"describe",
				"explain"
//				"",
//				"",
//				"",
//				"",
//				"",
//				"",
//				"",
//				"",
		};
		extern const int question_phrase_english_length;
	}
}

#endif /* NLP_QA_TEMPLATE_CHINESE_H_ */
